examples/render_all_grammars/dot/tests_functional_test_import_importoverride_first_new.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


35692568 -> 35684376[arrowtail=diamond, dir=both, headlabel="first 1..*"]
35692568 -> 35698104[arrowtail=diamond, dir=both, headlabel="third 1..*"]
35692568[ label="{First|}"]

35698104[ label="{Third|+chain:STRING\l}"]

35655608[ label="{ID|}"]

35661576[ label="{STRING|}"]

35667112[ label="{BOOL|}"]

35627560[ label="{INT|}"]

35593736[ label="{FLOAT|}"]

35104328[ label="{STRICTFLOAT|}"]

35625496[ label="{NUMBER|}"]
35625496 -> 35104328 [dir=back]
35625496 -> 35627560 [dir=back]

35659576[ label="{BASETYPE|}"]
35659576 -> 35625496 [dir=back]
35659576 -> 35593736 [dir=back]
35659576 -> 35667112 [dir=back]
35659576 -> 35655608 [dir=back]
35659576 -> 35661576 [dir=back]

35650600[ label="{*OBJECT|}"]
35650600 -> 35659576 [dir=back]

35684376 -> 35676776[arrowtail=diamond, dir=both, headlabel="second 1..*"]
35684376[ label="{Second|}"]


}
