examples/render_all_grammars/pu/tests_functional_test_import_importoverride_first_new.pu
@startuml
            set namespaceSeparator .
        first_new.First *-- "1..*" second.Second
first_new.First *-- "1..*" first_new.Third
class first_new.First  {
}


class first_new.Third  {
STRING chain
}


class ID <<match>> {
}


class STRING <<match>> {
}


class BOOL <<match>> {
}


class INT <<match>> {
}


class FLOAT <<match>> {
}


class STRICTFLOAT <<match>> {
}


class NUMBER <<match>> {
}

NUMBER <|-- STRICTFLOAT
NUMBER <|-- INT

class BASETYPE <<match>> {
}

BASETYPE <|-- NUMBER
BASETYPE <|-- FLOAT
BASETYPE <|-- BOOL
BASETYPE <|-- ID
BASETYPE <|-- STRING

class OBJECT <<abstract>> {
}

OBJECT <|-- BASETYPE

second.Second *-- "1..*" relative.third.Third
class second.Second  {
}


@enduml
